tap "homebrew/bundle"
tap "homebrew/services"
brew "mas"                   # mac app store command line tools (https://github.com/mas-cli/mas)

# editors
brew "emacs"

# terminal tools
brew "go-task"               # simplified Makefile alternative
brew "mpv"                   # media player

# development tools
brew "python@3.12"           # cpython interpreter
brew "black"                 # python code formatter
brew "rust"                  # compiler for the rust language
brew "git-secrets"           # prevents git commits of sensitive info
brew "jq"                    # JSON processor
brew "pygments"              # syntax highlighter

# security
cask "keepassxc"             # password manager with GUI
brew "gnupg"                 # GNU implementation of OpenPGP
brew "pinentry"              # dialog boxes for gnupg
#mas "Bitwarden", id: 1352778147  # password manager

# OS tools
brew "libnfs"                # NFS mount library
brew "syncthing", restart_service: true  # distributed file synchronizer
brew "zsh"                   # Z-shell
cask "iterm2"                # more powerful terminal
mas "BetterSnapTool", id: 417375580  # window management

# productivity tools
brew "texlive"               # LaTeX distribution
brew "ispell"                # international spell checker for editors
cask "obsidian"              # note taker and organizer
mas "Keynote", id: 409183694 # presentations
mas "Pages", id: 409201541   # document editor
mas "Numbers", id: 409203825 # spreadsheet
# brew "vale"                # markup-aware language linter
#mas "StopTheMadness", id: 1376402589  # browser customizer

# online services
brew "awscli"                # AWS command-line interface

# downloading
brew "yt-dlp"                # youtube and other side video downloader
cask "qbittorrent"           # bittorrent client

