tap "homebrew/bundle"
tap "homebrew/services"
brew "mas"                   # mac app store command line tools (https://github.com/mas-cli/mas)

# editors
brew "emacs"

# terminal tools
brew "bat"					 # source highlighting alt to cat
brew "tmux"                  # terminal multiplexer
brew "go-task"               # simplified Makefile alternative
brew "mpv"                   # media player

# development tools
brew "python@3.12"           # cpython interpreter
brew "black"                 # python code formatter
brew "rust"                  # compiler for the rust language
brew "rustfmt"               # rust formatter
brew "git-secrets"           # prevents git commits of sensitive info
brew "jq"                    # JSON processor
brew "pygments"              # syntax highlighter
cask "visual-studio-code"    # Code IDE

# fonts
tap "homebrew/cask-fonts"    # extra fonts
cask "homebrew/cask-fonts/font-cascadia-code"
cask "homebrew/cask-fonts/font-fira-code"

# security
cask "keepassxc"             # password manager with GUI
brew "gnupg"                 # GNU implementation of OpenPGP
brew "pinentry"              # dialog boxes for gnupg
#mas "Bitwarden", id: 1352778147  # password manager

# OS tools
brew "libnfs"                # NFS mount library
#brew "syncthing", restart_service: true  # distributed file synchronizer
brew "zsh"                   # Z-shell
cask "kitty"                 # terminal emulator
#cask "iterm2"                # terminal emulator
#cask "little-snitch" # makes these Internet connections visible and puts you back in control!
mas "BetterSnapTool", id: 417375580  # window management

# productivity tools
brew "texlive"               # LaTeX distribution
brew "ispell"                # international spell checker for editors
cask "obsidian"              # note taker and organizer
mas "Keynote", id: 409183694 # presentations
mas "Pages", id: 409201541   # document editor
mas "Numbers", id: 409203825 # spreadsheet
# brew "vale"                # markup-aware language linter
# mas "StopTheMadness", id: 1376402589  # browser customizer

# online services
brew "awscli"                # AWS command-line interface

# downloading
brew "yt-dlp"                # youtube and other side video downloader
cask "qbittorrent"           # bittorrent client

# Visual Code extensions
vscode "alefragnani.project-manager"        # Easily switch between projects
vscode "GitHub.remotehub"                   # Remotely browse and edit any GitHub repository
vscode "GitHub.vscode-pull-request-github"  # Pull Request and Issue Provider for GitHub
vscode "mhutchie.git-graph"                 # Better source control panel
vscode "ms-python.python"                   # Python IntelliSense, Linting, code formatting, etc.
vscode "ms-python.vscode-pylance"           # Language server for Python in VS Code
vscode "ms-vscode.azure-repos"              # Remotely browse and edit any Azure Repos
vscode "ms-vscode.remote-repositories"      # Remotely browse and edit git repositories
vscode "rust-lang.rust-analyzer"            # Rust language support for Visual Studio Code
vscode "stkb.rewrap"                        # Hard word wrapping for comments and other text at a given column
